import { Pipe, PipeTransform } from '@angular/core';

@Pipe({ name: 'translateToChinese' })
export class TranslateToChinesePipe implements PipeTransform {
    transform(value: any) {
        return value;

        if (!value) {
            return '';
        }

        let result = value;

        [
            ['敵方屬性に対して', '屬性敵人'],
            ['([0-9\.]+)%上昇', '+$1%'],
            ['自パーティの', '隊伍中'],
            ['属性', '屬性'],
            ['全味方の', '全體'],
            ['味方', '我方'],
            ['全体', '全體'],
            ['単体', '單體'],
            ['ボス', 'Boss'],
            ['防御', '防禦'],
            ['攻撃', '攻擊'],
            ['会心率', '爆擊率'],
            ['タイプ', '型'],
            ['キャラクター', '角色'],
            ['状態', '狀態'],
            ['自身に', '自己'],
            ['ヒートゲージ', '熱血值'],
            ['スキルクールタイム', 'CT'],
            ['スキルCT', 'CT'],
            ['ダメージ', '傷害'],

            ['敵([0-9\.]+)体へ攻撃力([0-9\.]+)%', '敵方$1位進行$2%'],
            ['敵(全|單)體へ攻撃力([0-9\.]+)%攻撃', '敵$1體進行$2%攻撃'],
            ['隊伍中(.{1})屬性角色1体につき', '$1屬 * '],
            ['被傷害の([0-9\.]+)%を攻撃者へ反射', '反彈$1%傷害'],
            ['(.{2})狀態の敵に対して', '對$1狀態的敵方'],
            ['バトルスキルの', '戰鬥技能'],
            ['通常攻撃', '普通攻擊'],

            ['にする確率', '機率'],
            ['になる確率(を|が)', '機率'],
            ['%の確率で', '%'],
            ['が([0-9\.]+)%ずつ上昇', '逐漸+$1%'],

            ['が高い', '較高的'],
            ['残HPが低い', '剩餘血量最低的'],
            ['クエストクリア時の資金獲得量', '任務資金所得'],
            ['クエストのアイテムドロップ', '任務道具掉落率'],
            ['(.{2})型の敵の人数', '敵方$1型人數'],
            ['ドンパチで敵陣営よりも連合Ptの割合が少ない場合は更に', '連合戰落後敵方Pt時'],
            ['(.{1})性の敵(の)*', '敵方$1性'],
            ['秒間(の|で)*', '秒'],
            ['の(低|高)い', '較$1'],
            ['体(の|へ)', '人'],

            ['ランダム', '隨機'],
            ['(が|を)*上升', '+'],
            ['狀態機率', ''],
            ['-([0-9\.]+)%減少', '-$1%'],
            ['の獲得Ptが', 'の獲得Pt'],
            ['の獲得Pt', '所得Pt'],
            ['タイマン', '連合戰'],
            ['のとき', ''],
            ['付与', ''],
            ['%で', '%'],

            ['（アビリティレベル最大時）', ''],
            ['（スキルレベル最大時）', ''],
            ['の我方の', ''],

            ['の構え', '架式'],
            ['の陣', '陣'],

            // ['を', ''],
            ['と', ' 及 '],
        ].forEach((args) => {
            let [match, replaceWith] = args;

            const temp = result.replace(new RegExp(match, 'gm'), replaceWith);

            if (temp) {
                result = temp;
            }
        });

        return result;
    }
}
